Revit 2027 API
FailureDefinitionRegistry.FindFailureDefinition Method
 Finds a specific FailureDefinition by a given FailureDefinitionId.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FailureDefinitionAccessor FindFailureDefinition(
	FailureDefinitionId id
)
Public Function FindFailureDefinition (
	id As FailureDefinitionId
) As FailureDefinitionAccessor
public:
FailureDefinitionAccessor^ FindFailureDefinition(
	FailureDefinitionId^ id
)
member FindFailureDefinition :
        id : FailureDefinitionId -> FailureDefinitionAccessor
Parameters
id FailureDefinitionId
 The id of the FailureDefinition.
Return Value
FailureDefinitionAccessor
 The accessor of the found FailureDefinition, or null, if the FailureDefinition was not found.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FailureDefinitionRegistry Class
Autodesk.Revit.DB Namespace